In [2]:
import pandas as pd

In [3]:
dict = {
    'name': ['Zh3', 'Li4', 'Wang5', 'Zhao6'],
    'sex' : ['Male','Female', 'Male', 'Female'],
    'age' : [18, 19, 20, 21]
}

In [4]:
dict

{'name': ['Zh3', 'Li4', 'Wang5', 'Zhao6'],
 'sex': ['Male', 'Female', 'Male', 'Female'],
 'age': [18, 19, 20, 21]}

In [5]:
df = pd.DataFrame(dict)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   sex     4 non-null      object
 2   age     4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [7]:
df.age.astype('str')

0    18
1    19
2    20
3    21
Name: age, dtype: object

In [8]:
df[['name','sex']]

    name     sex
0    Zh3    Male
1    Li4  Female
2  Wang5    Male
3  Zhao6  Female

In [9]:
df.name

0      Zh3
1      Li4
2    Wang5
3    Zhao6
Name: name, dtype: object

In [10]:
df.iloc[0]

name     Zh3
sex     Male
age       18
Name: 0, dtype: object

In [11]:
df

    name     sex  age
0    Zh3    Male   18
1    Li4  Female   19
2  Wang5    Male   20
3  Zhao6  Female   21

In [12]:
df[0:2]

  name     sex  age
0  Zh3    Male   18
1  Li4  Female   19

In [13]:
df[1:]

    name     sex  age
1    Li4  Female   19
2  Wang5    Male   20
3  Zhao6  Female   21

In [14]:
# Assignment

In [15]:
df.age = 22

In [16]:
df['age'] = [18,19,20,33]

In [17]:
df

    name     sex  age
0    Zh3    Male   18
1    Li4  Female   19
2  Wang5    Male   20
3  Zhao6  Female   33

In [18]:
#adding a new column

In [19]:
df['Country'] = ['China', 'SG', 'MY','ID']

In [20]:
df

    name     sex  age Country
0    Zh3    Male   18   China
1    Li4  Female   19      SG
2  Wang5    Male   20      MY
3  Zhao6  Female   33      ID

In [21]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
df[ df.age > 18]

    name     sex  age Country
1    Li4  Female   19      SG
2  Wang5    Male   20      MY
3  Zhao6  Female   33      ID

In [23]:
df.age > 18

0    False
1     True
2     True
3     True
Name: age, dtype: bool

In [24]:
df[ df.sex == 'Male']

    name   sex  age Country
0    Zh3  Male   18   China
2  Wang5  Male   20      MY

In [25]:
(df.sex == 'Male') & (df.age > 19)

0    False
1    False
2     True
3    False
dtype: bool

In [26]:
df[ (df.sex == 'Male') & (df.age > 19) ]

    name   sex  age Country
2  Wang5  Male   20      MY

In [27]:
df

    name     sex  age Country
0    Zh3    Male   18   China
1    Li4  Female   19      SG
2  Wang5    Male   20      MY
3  Zhao6  Female   33      ID

In [28]:
df.query(  '(sex == "Male") and (age>10)  ')

    name   sex  age Country
0    Zh3  Male   18   China
2  Wang5  Male   20      MY

In [29]:
df

    name     sex  age Country
0    Zh3    Male   18   China
1    Li4  Female   19      SG
2  Wang5    Male   20      MY
3  Zhao6  Female   33      ID

In [30]:
df.iloc[1]

name          Li4
sex        Female
age            19
Country        SG
Name: 1, dtype: object

In [31]:
df.loc[1]

name          Li4
sex        Female
age            19
Country        SG
Name: 1, dtype: object

In [32]:
df

    name     sex  age Country
0    Zh3    Male   18   China
1    Li4  Female   19      SG
2  Wang5    Male   20      MY
3  Zhao6  Female   33      ID

In [33]:
df[ df['age'] > 21]

    name     sex  age Country
3  Zhao6  Female   33      ID